
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Взаиморасчеты.Записывать = Истина;
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = ДатаРасхода;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Статья = СтатьяРасходаДенежныхСредств;
	Движение.Сумма = СуммаРасхода;
    Движение.Дата = ДатаРасхода;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРасход") Тогда
		// Заполнение шапки
		ДатаРасхода = ДанныеЗаполнения.ДатаРасхода;
		Договор = ДанныеЗаполнения.Договор;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СтатьяРасходаДенежныхСредств = ДанныеЗаполнения.СтатьяРасходаДенежныхСредств;
		СуммаРасхода = ДанныеЗаполнения.СуммаРасхода;
	КонецЕсли;
КонецПроцедуры
