
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)                        
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя);
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательОбъект.Наименование = ИмяПользователя;
		ПользовательОбъект.Записать();
		Пользователь = ПользовательОбъект.Ссылка;
	КонецЕсли;                                   
	
	ПараметрыСеанса.ТекущийПользователь = Пользователь;
КонецПроцедуры
