
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьСтатусДокумента();
	УстановитьДоступностьЭлементов();
	УстановитьТекущегоПользователя();
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусДокумента()
	СтатусДокумента = ОбщегоНазначения.ПолучитьСтатусДокумента(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЭтаФорма.ТолькоПросмотр = НЕ ОбщегоНазначения.ЕстьПравоНаИзменениеДокумента(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура УстановитьТекущегоПользователя()
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры