
&НаСервере
Процедура СформироватьКалендарьНаСервере()
	ТабДок = РеквизитФормыВЗначение("Объект").СформироватьКалендарь(Период); 
	ПлатежныйКалендарь = ТабДок;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКалендарь(Команда)
	СформироватьКалендарьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьБПНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРасход.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаРасход КАК ЗаявкаНаРасход
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПланированиеРасхода КАК ПланированиеРасхода
		|		ПО ЗаявкаНаРасход.Ссылка = ПланированиеРасхода.ДокументОснование
		|ГДЕ
		|	ПланированиеРасхода.ДокументОснование ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		БП = БизнесПроцессы.СогласованиеПлатежа.СоздатьБизнесПроцесс();
		БП.Дата = ТекущаяДата();
		БП.Документ = ВыборкаДетальныеЗаписи.Ссылка;  
		БП.Записать();
		БП.Старт();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьБП(Команда)
	СформироватьБПНаСервере();
КонецПроцедуры
